{
  "main": {
    "name": "Max Grier",
    "occupation": "Financial Analyst",
    "description": "I am currently working for Boeing Commercial Aiplanes.  I enjoy using my Computer Science experience to automate and improve processes",
    "image": "profilepic.jpg",
    "bio": "I am a Pacific Northwest native originally from Gig Harbor, WA.  I enjoy deep diving into data and providing insights to drive improvements.  My passion is to create new tools and processes that simplify and automate tasks.  Outside of work, I enjoy traveling, yoga, cycling, and spending time at the beach.",
    "contactmessage": "Please reach out to me or connect with me on Linkedin.",
    "email": "max.grier1@gmail.com",
    "phone": "253-255-3752",
    "address": {
      "street": "13219 46th Ave SE",
      "city": "Mill Creek",
      "state": "WA",
      "zip": "98012"
    },
    "website": "http://grierm.github.io",
    "resumedownload": "http://grierm.github.io/resume.pdf",
    "social": [
      {
        "name": "facebook",
        "url": "http://facebook.com/",
        "className": "fa fa-facebook"
      },
      {
        "name": "twitter",
        "url": "http://twitter.com",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/maxgrier/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "http://instagram.com/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "http://github.com/maxgrier",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "",
    "education": [
      {
        "school": "Oregon State University",
        "degree": "Bachelor's in Computer Science",
        "graduated": "Expected June 2022",
        "description": ""
      },
      {
        "school": "Montana State University",
        "degree": "Bachelor's in Business Finance",
        "graduated": "May 2015",
        "description": ""
      }
    ],
    "work": [
      {
        "company": "The Boeing Company",
        "title": "Financial Analyst",
        "years": "February 2019 - Present",
        "description": "Developer on the ATC Speech Recognition project to create the metadata preprocessing pipeline through Google cloud and Docker containers which feeds the React front end in order to monitor server health.  Supporting the Director of Propulsion as well as 787 and 777x commercial airplanes to manage headcount, budget forecasts, analyze and interpret variances, and report findings to Leadership.  Coordinate with Project Managers, Engineers, and Senior Managers to ensure accurate resource and budget forecasts.  Extract and compile weekly, monthly, and quarterly financial performance reports for Executives and Senior Managers.  Responsible for maintaining $55 and $50 million in project funding for the Technology Integration and Advanced Materials portfolios, respectively.  Lead the development of standard reporting tools with COGNOS queries and compiled data with Power Query.  Finished the 2020 fiscal year with a 0.25% budget variance across the Advanced Materials portfolio"
      },
      {
        "company": "Northwest Plan Services",
        "title": "Retirement Plan Analyst",
        "years": "May 2017 - February 2019",
        "description": "Supported in managing $700 million in assets allocated across 22 plan assignments in collaboration with plan consultants and administrators within the retirement plan administration industry.  Retrieve daily price files from primary trust companies (Charles Schwab, T.D. Ameritrade, Matrix) to combine data and create compatible files to load into FIS Relius database; export and submit aggregate trades for all plans; troubleshoot potential trade discrepancies via pre-trade checks; review and resolve outstanding trade issues for all NWPS locations prior to nightly deadline.  Track cash flow through daily reconciliation of plan assets on Relius database against trust company level, including participantdirected transactions, revenue sharing, gains and losses, and forfeitures."
      }
    ],
    "skills": [
      {
        "name": "Python",
        "level": "80%"
      },
      {
        "name": "Excel",
        "level": "80%"
      },
      {
        "name": "SQL",
        "level": "70%"
      },
      {
        "name": "HTML5",
        "level": "60%"
      },
      {
        "name": "CSS",
        "level": "65%"
      },
      {
        "name": "Flask",
        "level": "50%"
      },
      {
        "name": "Git",
        "level": "50%"
      },
      {
        "name": "C",
        "level": "40%"
      },
      {
        "name": "Google Cloud",
        "level": "35%"
      },
      {
        "name": "ReactJs",
        "level": "35%"
      },
      {
        "name": "Apache Beam",
        "level": "35%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Canadian Wanderlust",
        "category": "My Travel Blog for my post-university travels",
        "image": "canadian-wanderlust.jpg",
        "url": "https://www.canadianwanderlust.com"
      },
      {
        "title": "Fury Fighting Gear",
        "category": "(offline now) A fighting gear company I started",
        "image": "fury-fighting-gear.jpg",
        "url": "http://www.timbakerdev.com"
      },
      {
        "title": "Original Thai Food",
        "category": "Website I built for a restaurant I like in Thailand",
        "image": "original-thai-food.jpg",
        "url": "http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title": "Resume Website",
        "category": "A React based resume website template",
        "image": "resume-website.jpg",
        "url": "http://www.timbakerdev.com"
      },
      {
        "title": "Smirkspace",
        "category": "(MVP Only) A React and Meteor based chat University project.",
        "image": "smirkspace.jpg",
        "url": "http://www.smirkspace.com"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user": "Kareem Abdul Jabbar"
      },
      {
        "text": "That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}
